#include "menu.h"
using namespace std;

void print_menu()
{
    system("color 0F");
    system("cls");
    cout << endl;
    cout << "    (\\_/)    Äîáðî ïîæàëîâàòü â ïðîãðàììó " << endl;
    cout << "    ( . .)    \"Õóäîæåñòâåííàÿ ãàëåðåÿ\"!" << endl;
    cout << "   c('')('')" << endl;
    cout << "   ______________________________________         ¶¶¶_¶¶¶" << endl;
    cout << "  |             Ìåíþ ïðîãðàììû           |       ¶¶¶¶¶¶¶¶¶" << endl;
    cout << "  |______________________________________|       ¶¶¶¶¶¶¶¶¶" << endl;
    cout << "  |         ×òî âû õîòèòå ñäåëàòü?       |        ¶¶¶¶¶¶¶" << endl;
    cout << "  |______________________________________|         ¶¶¶¶¶" << endl;
    cout << "  |**********  ÐÀÁÎÒÀ Ñ ÄÀÍÍÛÌÈ  ********|          ¶¶¶" << endl;
    cout << "  |Ââîä äàííûõ                   [1]     |           ¶" << endl;
    cout << "  |Âûâîä äàííûõ                  [2]     |            11," << endl;
    cout << "  |Óäàëåíèå äàííûõ               [3]     |              11," << endl;
    cout << "  |Ðåäàêòèðîâàíèå ñòðîêè         [4]     |               11," << endl;
    cout << "  |Óäàëåíèå êàðòèíû              [5]     |                11," << endl;
    cout << "  |______________________________________|                11," << endl;
    cout << "  |**********  ÐÀÁÎÒÀ Ñ ÔÀÉËÀÌÈ  ********|               11," << endl;
    cout << "  |Ñîçäàíèå ôàéëà                [6]     |              11," << endl;
    cout << "  |Óäàëåíèå ôàéëà                [7]     |          ¶¶¶_¶¶¶" << endl;
    cout << "  |Ñîõðàíåíèå äàííûõ â ôàéë      [8]     |         ¶¶¶¶¶¶¶¶¶" << endl;
    cout << "  |Âûãðóçêà èç ôàéëà             [9]     |         ¶¶¶¶¶¶¶¶¶" << endl;
    cout << "  |Ïðî÷èòàòü ñîäåðæèìîå ôàéëà    [10]    |          ¶¶¶¶¶¶¶" << endl;
    cout << "  |______________________________________|           ¶¶¶¶¶" << endl;
    cout << "  |**************  ÄÐÓÃÎÅ  **************|            ¶¶¶" << endl;
    cout << "  |Ïîèñê                         [11]    |             ¶" << endl;
    cout << "  |Ñîðòèðîâêà                    [12]    |           11," << endl;
    cout << "  |______________________________________|          11," << endl;
    cout << "  |               ÂÛÕÎÄ [0]              |          11," << endl;
    cout << "  |______________________________________|           11," << endl;
    cout << "                                                       11," << endl;
    cout << endl;
}

int get_variant() {
    string input;

    cout << "   ×òî âû õîòèòå ñäåëàòü? *Ââåäèòå ÷èñëî*" << endl;
    getline(cin,input);

    while (input != "1" && input != "2" && input != "3" && input != "4" && input != "5" && input != "6" && input != "7"
        && input != "8" && input != "9" && input != "10" && input != "11" && input != "0" && input != "12") {
        cout << "Âûáîð íå îïðåäåë¸í. Ââåäèòå êîððåêòíîå çíà÷åíèå!" << endl;
        getline(cin,input);
    }

    int variant = stoi(input);

    return variant;
}